---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.LengthParameterError
source: html/4e3f31fd-8b17-e0b7-d9a2-5637384ea803.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.LengthParameterError Property

This is used to post error. The "Total Length" parameter must be set to a strictly positive value.

## Syntax (C#)
```csharp
public static FailureDefinitionId LengthParameterError { get; }
```